# IsEmbedded Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ScheduleDefinition..::..IsEmbedded Property
ScheduleDefinition Class See Also
---
Indicates if this is an embedded ScheduleDefinition.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public bool IsEmbedded { get; }
```

Visual Basic
---
```text
Public ReadOnly Property IsEmbedded As Boolean
	Get
```

Visual C++
---
```text
public:
property bool IsEmbedded {
	bool get ();
}
```

# See Also
ScheduleDefinition Class
Autodesk.Revit.DB Namespace